// Домашня робота:
// - За допомогою циклу вивести значення від 10 до 0 
// for(let i = 10; i>-1; i--){
//     console.log(`Value ${i}`);
// }
// - Створити пустий массив і заповнити його всіма парними занченнями від 0 до 8
// let parValues =[];
// for(let i= 0; i<9; i++){
//     if(i%2 == 0){
//         parValues.push(i)
//     }
// }
// console.log(parValues);
// -  Створити цикл який виводить значення в консоль з двох масивів в такому  форматі "Сьогодні ....  у вас такі плани ..." 
let days = ["Понеділок", "Середа", "Неділя"] 
let plans = ["Урок 03", "Урок 04", "Вихідний"]
// if(days.length == plans.length){
//   for(let i = 0; i<days.length; i++){
//     console.log(`Сьогодні ${days[i]}  у вас такі плани ${plans[i]}`);
//   }  
// }


// -  Написати цикл який замінює відємне значення в масиві на 0  
let checkArr = [69, 96, -66, 77, 85, -85, 14, -20, 90, -36]
for(let i=0; i<checkArr.length; i++){
    if(checkArr[i]<0){
        checkArr[i] = 0;
    }
}
console.log(`Відсортований масив ${checkArr}`);
// - створити змінну в якій за допогою Prompt спитати який день неділі зараз. Далі написати swith який для вівторок четверг значень виводить ( Сьогодні ${day} у вас урок о 19) для інших днів свої варіанти,  а для значень що не відповідають умові виведіть default

let today = prompt('Який сьогодні день?');

switch (today) {
    case 'Вівторок':
    case 'вівторок':
    case 'Четверг':
    case 'четверг':
        console.log(`Сьогодні ${today} у вас урок о 19`);
        break;
    case 'Неділя':
        console.log(`Сьогодні ${today} у вас урок вихідний`);
        break;
    default:
        console.log('No information about this day');
        break;
}